Revit 2027 API
CableSize.NumberOfGroundConductors Property
 The number of Ground Conductors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfGroundConductors { get; set; }
Public Property NumberOfGroundConductors As Integer
	Get
	Set
public:
property int NumberOfGroundConductors {
	int get ();
	void set (int value);
}
member NumberOfGroundConductors : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for numberOfGroundConductors is negative.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace